test/src/test/testtool/EsbSoapWrapperPipe/01/in.xml

<SOAPENV:Envelope xmlns:SOAPENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAPENV:Header>
		<ns0:MessageHeader xmlns:ns0="http://www.nn.nl/">
			<ns0:From>
				<ns0:Id>portal</ns0:Id>
			</ns0:From>
			<ns0:To>
				<ns0:Location>TIBCO Service</ns0:Location>
			</ns0:To>
			<ns0:HeaderFields>
				<ns0:CPAId>cpid</ns0:CPAId>
				<ns0:ConversationId>ConversationId</ns0:ConversationId>
				<ns0:MessageId>MessageId</ns0:MessageId>
				<ns0:ExternalRefToMessageId>ExternalRefToMessageId</ns0:ExternalRefToMessageId>
				<ns0:Timestamp>2010-10-20T12:19:35</ns0:Timestamp>
			</ns0:HeaderFields>
		</ns0:MessageHeader>
	</SOAPENV:Header>
	<SOAPENV:Body>
		<CalculationRequest xmlns="http://www.frankframework.org/ISS/XSD/NL/LI/ActuarialCalculationsLifeRetail_1_CQAPVLI_1_Req_Rply">
			<SystemCode>L76HB000</SystemCode>
			<CalculationData>1:RS_INFO;835:ILIAS;645:ANP_VRH_3;</CalculationData>
		</CalculationRequest>
	</SOAPENV:Body>
</SOAPENV:Envelope>